from typing import Any

from src.utils import logger_setup, write_data, read_xlsx

logger = logger_setup()


def filter_by_state(operation: Any) -> Any:
    """
    Функция принимает на вход список транзакций и возвращает новый список,
    содержащий только те словари, у которых ключ содержит переданное значение
    """
    data = []
    for transaction in operation:
        if "Переводы" in transaction["Категория"] and transaction["Описание"].endswith("."):
            data.append(transaction)
    write_data("results.json", data)
    return data


def main_services() -> None:
    """Главная функция в этом модуле"""
    transaction = filter_by_state(
        [
            {
                "Дата операции": "22.12.2021 23:30:45",
                "Дата платежа": "23.12.2021",
                "Номер карты": "*1781",
                "Статус": "OK",
                "Сумма операции": 28001.94,
                "Валюта операции": "RUB",
                "Сумма платежа": 28001.94,
                "Валюта платежа": "RUB",
                "Кэшбэк": 10,
                "Категория": "Переводы",
                "MCC": 5814,
                "Описание": "Перевод Кредитная карта. ТП 10.2 RUR",
                "Бонусы (включая кэшбэк)": 0.00,
                "Округление на инвесткопилку": 0.0,
                "Сумма операции с округлением": 28001.94,
            },
            {
                "Дата операции": "12.06.2024 14:20:34",
                "Дата платежа": "12.06.2024",
                "Номер карты": "*1781",
                "Статус": "OK",
                "Сумма операции": 2000.0,
                "Валюта операции": "RUB",
                "Сумма платежа": 2000.0,
                "Валюта платежа": "RUB",
                "Кэшбэк": None,
                "Категория": "Переводы",
                "MCC": None,
                "Описание": "Алексей П.",
                "Бонусы (включая кэшбэк)": 0,
                "Округление на инвесткопилку": 0.0,
                "Сумма операции с округлением": 2000.0,
            },
        ]
    )
    print(f"Результат просмотра:\n{read_xlsx('../data/operations.xlsx')}")
    print(f"Результат обслуживания: \n{transaction}")
